"""
 Реализовать класс Matrix (матрица). Обеспечить перегрузку
 конструктора класса (метод __init__()), который должен принимать
 данные (список списков) для формирования матрицы.
 Подсказка: матрица — система некоторых математических величин,
 расположенных в виде прямоугольной схемы.
 Примеры матриц: 3 на 2, 3 на 3, 2 на 4.
 Следующий шаг — реализовать перегрузку метода __str__() для
 вывода матрицы в привычном виде.
 Далее реализовать перегрузку метода __add__() для реализации
 операции сложения двух объектов класса Matrix (двух матриц).
 Результатом сложения должна быть новая матрица.
 Подсказка: сложение элементов матриц выполнять
 поэлементно — первый элемент первой строки первой
 матрицы складываем с первым элементом первой строки
 второй матрицы и т.д.
 """


class Matrix:
    def __init__(self, values):
        self.values = values

    def __str__(self):
        return str('\n'.join(['\t'.join(list(map(str, i))) for i in self.values]))


mtrx = Matrix([[1, 1, 0], [2, 17, 113], [50, 14, -8]])

print(mtrx)
